function Ked = DiskElementStiffness(md,imdmo,imdy,FAI,Wx,Wy,Wz)
%DiskElementStiffness   
%此函数返回质量为md、
%平均转动惯量为imdmo、(md,imdmo,imdy,FAI,Wx,Wy,Wz)
%绕Oy主轴的主惯性矩为imdy的转盘的节点刚度矩阵Ked(t)，
%节点刚度矩阵Ked(t)的大小为6 x 6。
a = [0 0 0 0 0 0; %关于转盘加速度的陀螺效应
     0 0 0 0 0 0;
     0 0 0 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 0 0 0;
     0 0 0 imdy 0 0];
b = [0 0 0 0 0 0; %关于参考系R的绕x轴转动加速度的效应
     0 0 -md 0 0 0;
     0 md 0 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 0 0 -imdy;
     0 0 0 0 0 0];
c = [0 0 md 0 0 0; %关于参考系R的绕y轴转动加速度的效应
     0 0 0 0 0 0;
     -md 0 0 0 0 0; 
     0 0 0 0 0 imdmo;
     0 0 0 0 0 0;
     0 0 0 imdy-imdmo 0 0];
d = [0 -md 0 0 0 0; %关于参考系R的绕z轴转动加速度的效应
     md 0 0 0 0 0;
     0 0 0 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 imdy 0 0;
     0 0 0 0 0 0];
e = [0 0 0 0 0 0; %关于转盘转速和参考系R的绕z轴转速的效应
     0 0 0 0 0 0;
     0 0 0 0 0 0; 
     0 0 0 imdy 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 imdy];
f = [0 0 0 0 0 0; %关于参考系R的绕x轴转速的平方的效应
     0 -md 0 0 0 0;
     0 0 -md 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 -(imdy-imdmo)];
g = [-md 0 0 0 0 0; %关于参考系R的绕y轴转速的平方的效应
     0 0 0 0 0 0;
     0 0 -md 0 0 0; 
     0 0 0 imdy-imdmo 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 imdy-imdmo];
h = [-md 0 0 0 0 0; %关于参考系R的绕z轴转速的平方的效应
     0 -md 0 0 0 0;
     0 0 0 0 0 0; 
     0 0 0 -(imdy-imdmo) 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 0];
i = [0 md 0 0 0 0; %关于参考系R的绕x轴和y轴转速的效应
     md 0 0 0 0 0;
     0 0 0 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 0];
 j = [0 0 md 0 0 0; %关于参考系R的绕x轴和z轴转速的效应
     0 0 0 0 0 0;
     md 0 0 0 0 0; 
     0 0 0 0 0 (imdy-imdmo);
     0 0 0 0 0 0;
     0 0 0 (imdy-imdmo) 0 0];
 k = [0 0 0 0 0 0; %关于参考系R的绕y轴和z轴转速的效应
     0 0 md 0 0 0;
     0 md 0 0 0 0; 
     0 0 0 0 0 0;
     0 0 0 0 0 0;
     0 0 0 0 0 0];
Ked = a*diff(FAI,2)+b*diff(Wx)+c*diff(Wy)+d*diff(Wz)+e*diff(FAI)*Wy+f*Wx^2+g*Wy^2+h*Wz^2+i*Wx*Wy+j*Wx*Wz+k*Wy*Wz;%已经写完
end